app/controllers/lti_registration_wips_controller.rb

  def index
    action = params[:action]
    registration_id = params[:registration_id]
    registration = Lti2Tp::Registration.find(registration_id)
    @lti_registration_wip = LtiRegistrationWip.new

    # On orig registration, first assume tenant_name == name
    timeref = Time.now.strftime('%I%M.%S')
    # @lti_registration_wip.tenant_name = registration.message_type == 'registration' \
    #         ? "#{registration.tenant_basename}-#{timeref}" : registration.tenant_name

    #REI
    registration.tool_proxy_guid = registration.reg_key
    registration.save
    @lti_registration_wip.tenant_name = registration.reg_key

    @lti_registration_wip.registration_id = registration_id
    @lti_registration_wip.registration_return_url = params[:return_url]

    tcp_wrapper = JsonWrapper.new JSON.load(registration.tool_consumer_profile_json)
    @lti_registration_wip.support_email = tcp_wrapper.first_at('product_instance.support.email')
    @lti_registration_wip.product_name = tcp_wrapper.first_at('product_instance.product_info.product_name.default_value')

    @lti_registration_state = 'check_tenant'

    @lti_registration_wip.save
---
UPDATE `lti2_tp_registrations` SET `tool_proxy_guid` = 'bf32f920-41c6-0133-036a-20c9d07c6451', `updated_at` = '2015-09-20 13:09:41' WHERE `lti2_tp_registrations`.`id` = 121
INSERT INTO `lti_registration_wips` (`created_at`, `product_name`, `registration_id`, `registration_return_url`, `support_email`, `tenant_name`, `updated_at`) VALUES ('2015-04-23 23:50:33', 'Elan/LuMoS', 119, '/lti2_tp/registrations', 'john.tibbetts@kinexis.com', 'Elan University513', '2015-04-23 23:50:33')

  def show
    @lti_registration_wip = LtiRegistrationWip.find(request.params[:id])
    @registration = Lti2Tp::Registration.find(@lti_registration_wip.registration_id)

    # get tool profile from REI_Impl
    lti_tool_provider_url = Rails.application.config.tool_provider_registry.registry['lti_tool_provider_url']
    response = HTTParty.get("#{lti_tool_provider_url}/tool_profiles?registration_id=#{@registration.id}")
    @registration.tool_profile_json = response.body
    #REI only

    @registration.save
---
SELECT  `lti_registration_wips`.* FROM `lti_registration_wips`  WHERE `lti_registration_wips`.`id` = 135 LIMIT 1
UPDATE `lti2_tp_registrations` SET `status` = 'register', `tool_proxy_response` = '{\"@context\":\"http://purl.imsglobal.org/ctx/lti/v2/ToolProxyId\",\"@type\":\"ToolProxy\",\"@id\":null,\"tool_proxy_guid\":\"a79b53f0-42d3-0133-af00-20c9d07c6451\"}', `updated_at` = '2015-09-21 21:14:31' WHERE `lti2_tp_registrations`.`id` = 131

  def update
    @lti_registration_wip = LtiRegistrationWip.find(params[:id])
    @lti_registration_wip.tenant_name = params[:lti_registration_wip][:tenant_name]
    @lti_registration_wip.save

    registration = Lti2Tp::Registration.find(@lti_registration_wip.registration_id)
    registration.tenant_name = @lti_registration_wip.tenant_name
    registration.save
---
SELECT  `lti_registration_wips`.* FROM `lti_registration_wips`  WHERE `lti_registration_wips`.`id` = 202 LIMIT 1
UPDATE `lti_registration_wips` SET `tenant_name` = 'Elan University708', `updated_at` = '2015-04-25 14:08:10' WHERE `lti_registration_wips`.`id` = 213
UPDATE `tenants` SET `secret` = '0375489430051f0f18cabb61e27992a3', `tenant_key` = '66ff6a00-cd82-0132-5378-20c9d07c6451', `updated_at` = '2015-04-25 14:08:10' WHERE `tenants`.`id` = 118
SELECT  `tenants`.* FROM `tenants`  WHERE `tenants`.`tenant_name` = 'Elan University513'  ORDER BY `tenants`.`id` ASC LIMIT 1
UPDATE `lti2_tp_registrations` SET `status` = 'register', `tool_proxy_response` = '---\n\"@context\": http://purl.imsglobal.org/ctx/lti/v2/ToolProxyId\n\"@type\": ToolProxy\n\"@id\": http://rails.kinexis.com:4000/tools/736d6850-fc05-0132-2e20-20c9d07c6451\ntool_proxy_guid: 736d6850-fc05-0132-2e20-20c9d07c6451\ntc_half_shared_secret: 772b9cd2e385958a820f14029e9cf1b4cc5605ec7172e82953d8d26d2f3dd0ea47a98b24ccac194c091f9132f3aaeb1f2c7b1f1f4fee860cecf12b7d373511cf\n', `updated_at` = '2015-06-23 18:42:16' WHERE `lti2_tp_registrations`.`id` = 22